// ==========================================
// proc.c
// 内核函数，用于实现系统调用功能
// ==========================================

#include "type.h"
#include "const.h"
#include "protect.h"
#include "proto.h"
#include "string.h"
#include "proc.h"
#include "global.h"

/*======================================================================*
                            sys_get_ticks
 *----------------------------------------------------------------------*
 * 作用：最简单的系统调用函数，返回了内核中的全局变量ticks
 *======================================================================*/
PUBLIC int sys_get_ticks()
{
	return ticks;
}







